CS-4331/notes/3 - Safety.org

* Safety
** Facets
- Ambient conditions
- Location
- UAV Condition
- Spectators
- Pilot

** FAA Safety Rules
- Always avoid manned aircraft.
- Never operate in a careless or reckless manner.
- Keep your drone within sight. If you use First Person View or similar technology, you must have a visual observer always keep your drone within unaided sight. (for example, no binoculars.)
- Cannot be a pilot or visual observer for more than one drone operation at a time.
- Do not fly a drone over people unless directly participating in the operation.
- Do not operate your drone from a moving object.
- All drones must have a unique ID broadcasted (in terms of telemetry information.)

** Night training
You must complete the updated knowledge test or online training that includes content on operating at night.

** Weather and site safety check
- Chance of precipitation less than 10%.
- Wind speed under 15 knots. (20 mph)
- Cloud base at least 500 feet AGL.
- Visibility at least 3 statute miles (SM)
- If flying at dawn/dusk, check civil twilight hours.

** Site safety check
- Establish take-off, landing, emergency hover zones.
- Potential for electromagnetic interference.
- Look for towers, wires, buildings, trees, and other obstructions.

** Visual Inspection
- Registration number is displayed properly and is legible
- Look for abnormalities (frame, propellers, etc)
- Gimbal clamp and lens clamp...

** Powering up
- Discuss flogjy ,ossopm
- Turn on transmitter/remote control app
- Turn on aircraft
- Verify connection.
- Position antennas on transmitter.
- More...

** Taking off
- Take off to eye level altitude for aboute 10-15 seconds.
- Look for imbalances.
- Listen for abnormal sounds.
- Pitch, roll, yaw to test.

** Flying over people
- Category 1 (low risk)
- Category 2
- Category 3
- Category 4 (high risk)
