CS-4331/notes/html_output/3 - Safety.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-22 Wed 09:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Kieran Lavato" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0bd8dff">1. Safety</a>
<ul>
<li><a href="#orgedae037">1.1. Facets</a></li>
<li><a href="#org393673c">1.2. FAA Safety Rules</a></li>
<li><a href="#org49ec28e">1.3. Night training</a></li>
<li><a href="#orga3d71bf">1.4. Weather and site safety check</a></li>
<li><a href="#org7e038b8">1.5. Site safety check</a></li>
<li><a href="#org701a706">1.6. Visual Inspection</a></li>
<li><a href="#org1b6e700">1.7. Powering up</a></li>
<li><a href="#orgbaefa6d">1.8. Taking off</a></li>
<li><a href="#orgcb67882">1.9. Flying over people</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0bd8dff" class="outline-2">
<h2 id="org0bd8dff"><span class="section-number-2">1.</span> Safety</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgedae037" class="outline-3">
<h3 id="orgedae037"><span class="section-number-3">1.1.</span> Facets</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Ambient conditions</li>
<li>Location</li>
<li>UAV Condition</li>
<li>Spectators</li>
<li>Pilot</li>
</ul>
</div>
</div>
<div id="outline-container-org393673c" class="outline-3">
<h3 id="org393673c"><span class="section-number-3">1.2.</span> FAA Safety Rules</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Always avoid manned aircraft.</li>
<li>Never operate in a careless or reckless manner.</li>
<li>Keep your drone within sight. If you use First Person View or similar technology, you must have a visual observer always keep your drone within unaided sight. (for example, no binoculars.)</li>
<li>Cannot be a pilot or visual observer for more than one drone operation at a time.</li>
<li>Do not fly a drone over people unless directly participating in the operation.</li>
<li>Do not operate your drone from a moving object.</li>
<li>All drones must have a unique ID broadcasted (in terms of telemetry information.)</li>
</ul>
</div>
</div>
<div id="outline-container-org49ec28e" class="outline-3">
<h3 id="org49ec28e"><span class="section-number-3">1.3.</span> Night training</h3>
<div class="outline-text-3" id="text-1-3">
<p>
You must complete the updated knowledge test or online training that includes content on operating at night.
</p>
</div>
</div>
<div id="outline-container-orga3d71bf" class="outline-3">
<h3 id="orga3d71bf"><span class="section-number-3">1.4.</span> Weather and site safety check</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Chance of precipitation less than 10%.</li>
<li>Wind speed under 15 knots. (20 mph)</li>
<li>Cloud base at least 500 feet AGL.</li>
<li>Visibility at least 3 statute miles (SM)</li>
<li>If flying at dawn/dusk, check civil twilight hours.</li>
</ul>
</div>
</div>
<div id="outline-container-org7e038b8" class="outline-3">
<h3 id="org7e038b8"><span class="section-number-3">1.5.</span> Site safety check</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Establish take-off, landing, emergency hover zones.</li>
<li>Potential for electromagnetic interference.</li>
<li>Look for towers, wires, buildings, trees, and other obstructions.</li>
</ul>
</div>
</div>
<div id="outline-container-org701a706" class="outline-3">
<h3 id="org701a706"><span class="section-number-3">1.6.</span> Visual Inspection</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Registration number is displayed properly and is legible</li>
<li>Look for abnormalities (frame, propellers, etc)</li>
<li>Gimbal clamp and lens clamp&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org1b6e700" class="outline-3">
<h3 id="org1b6e700"><span class="section-number-3">1.7.</span> Powering up</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Discuss flogjy ,ossopm</li>
<li>Turn on transmitter/remote control app</li>
<li>Turn on aircraft</li>
<li>Verify connection.</li>
<li>Position antennas on transmitter.</li>
<li>More&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-orgbaefa6d" class="outline-3">
<h3 id="orgbaefa6d"><span class="section-number-3">1.8.</span> Taking off</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Take off to eye level altitude for aboute 10-15 seconds.</li>
<li>Look for imbalances.</li>
<li>Listen for abnormal sounds.</li>
<li>Pitch, roll, yaw to test.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcb67882" class="outline-3">
<h3 id="orgcb67882"><span class="section-number-3">1.9.</span> Flying over people</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Category 1 (low risk)</li>
<li>Category 2</li>
<li>Category 3</li>
<li>Category 4 (high risk)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kieran Lavato</p>
<p class="date">Created: 2025-01-22 Wed 09:49</p>
</div>
</body>
</html>
